In [1]:
import pandas as pd
import numpy as np

In [2]:
titanic = pd.read_csv("titanic.csv")

In [3]:
titanic["age"]

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [4]:
age = titanic["age"]

In [5]:
age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [6]:
age.info()

<class 'pandas.core.series.Series'>
RangeIndex: 891 entries, 0 to 890
Series name: age
Non-Null Count  Dtype
--------------  -----
714 non-null    float64
dtypes: float64(1)
memory usage: 7.1 KB

In [7]:
age.to_frame().info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   age     714 non-null    float64
dtypes: float64(1)
memory usage: 7.1 KB

In [8]:
age.unique()

array([22.  , 38.  , 26.  , 35.  ,   nan, 54.  ,  2.  , 27.  , 14.  ,
        4.  , 58.  , 20.  , 39.  , 55.  , 31.  , 34.  , 15.  , 28.  ,
        8.  , 19.  , 40.  , 66.  , 42.  , 21.  , 18.  ,  3.  ,  7.  ,
       49.  , 29.  , 65.  , 28.5 ,  5.  , 11.  , 45.  , 17.  , 32.  ,
       16.  , 25.  ,  0.83, 30.  , 33.  , 23.  , 24.  , 46.  , 59.  ,
       71.  , 37.  , 47.  , 14.5 , 70.5 , 32.5 , 12.  ,  9.  , 36.5 ,
       51.  , 55.5 , 40.5 , 44.  ,  1.  , 61.  , 56.  , 50.  , 36.  ,
       45.5 , 20.5 , 62.  , 41.  , 52.  , 63.  , 23.5 ,  0.92, 43.  ,
       60.  , 10.  , 64.  , 13.  , 48.  ,  0.75, 53.  , 57.  , 80.  ,
       70.  , 24.5 ,  6.  ,  0.67, 30.5 ,  0.42, 34.5 , 74.  ])

In [9]:
len(age.unique())

89

In [10]:
age.nunique(dropna= False)

89

In [11]:
age.value_counts(sort = False)

age
22.00    27
38.00    11
26.00    18
35.00    18
54.00     8
         ..
0.67      1
30.50     2
0.42      1
34.50     1
74.00     1
Name: count, Length: 88, dtype: int64

In [12]:
age.value_counts(sort = False, dropna=True, ascending = False, normalize = False)

age
22.00    27
38.00    11
26.00    18
35.00    18
54.00     8
         ..
0.67      1
30.50     2
0.42      1
34.50     1
74.00     1
Name: count, Length: 88, dtype: int64

In [13]:
age.value_counts(sort = True, dropna= True, ascending= False, normalize= False)

age
24.00    30
22.00    27
18.00    26
19.00    25
28.00    25
         ..
36.50     1
55.50     1
0.92      1
23.50     1
74.00     1
Name: count, Length: 88, dtype: int64

In [14]:
summer = pd.read_csv("summer.csv")

In [15]:
summer.head()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver

In [16]:
summer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31165 entries, 0 to 31164
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Year        31165 non-null  int64
 1   City        31165 non-null  object
 2   Sport       31165 non-null  object
 3   Discipline  31165 non-null  object
 4   Athlete     31165 non-null  object
 5   Country     31161 non-null  object
 6   Gender      31165 non-null  object
 7   Event       31165 non-null  object
 8   Medal       31165 non-null  object
dtypes: int64(1), object(8)
memory usage: 2.1+ MB

In [17]:
athlete = summer["Athlete"]

In [18]:
athlete.head()

0         HAJOS, Alfred
1      HERSCHMANN, Otto
2     DRIVAS, Dimitrios
3    MALOKINIS, Ioannis
4    CHASAPIS, Spiridon
Name: Athlete, dtype: object

In [19]:
athlete.value_counts()

Athlete
PHELPS, Michael          22
LATYNINA, Larisa         18
ANDRIANOV, Nikolay       15
ONO, Takashi             13
MANGIAROTTI, Edoardo     13
                         ..
ZAKA, Uddin               1
ZAFAR, Hayat              1
MUHAMMAD, Rashid          1
MANNA, Muhammad Afzal     1
LIDBERG, Jimmy            1
Name: count, Length: 22762, dtype: int64

In [20]:
pd.Series([10,25.6,36,2])

0    10.0
1    25.6
2    36.0
3     2.0
dtype: float64

In [21]:
sales = np.array([10,25,6,36,2])
sales

array([10, 25,  6, 36,  2])

In [22]:
pd.Series(sales)

0    10
1    25
2     6
3    36
4     2
dtype: int32

# from list

## dictionary to series

In [23]:
dic = {"Mon":10, "Tue":25, "Wed":6, "Thu": 36, "Fri" : 2}
dic

{'Mon': 10, 'Tue': 25, 'Wed': 6, 'Thu': 36, 'Fri': 2}

In [24]:
sales = pd.Series(dic)

In [25]:
sales

Mon    10
Tue    25
Wed     6
Thu    36
Fri     2
dtype: int64

In [26]:
pd.Series(dic, index = ["Fri", "Sat", "Sun", "Mon", "Tue", "Wed"])

Fri     2.0
Sat     NaN
Sun     NaN
Mon    10.0
Tue    25.0
Wed     6.0
dtype: float64

## Indexing and Slicing

In [27]:
titanic = pd.read_csv("titanic.csv")

In [28]:
age = titanic.age

In [29]:
age[0]
# 대괄호를 이용하면 파이썬이 내부적으로 순서에 기반한 인덱싱을 하는지, 인덱싱 라벨에 기반한 인덱싱을 하는지 알기 어려움

22.0

In [30]:
age[2]
# 순서에 기반한 인덱싱이라면? 만약 -2를 했을 경우 아래에서부터 2번째 값이 출력될 것.
# 그러나 -2를 하면 에러가 뜸. 따라서 인덱싱 라벨에 기반한 인덱싱이라고 추론 가능

26.0

In [31]:
age.iloc[-1]
# 순서 기반 인덱싱을 하려면 iloc 연산자 사용

32.0

##### 결론 : Rangeindex로 인덱스가 있을 때, 대괄호를 이용한 슬라이싱이나 인덱싱은 순서 기반인지 인덱스 라벨 기반인지 알기 어려움. 따라서 iloc 사용이 적합
- iloc 연산자를 loc 연산자로 바꾸면 라벨 기반 인덱싱 가능
- 라벨 기반 인덱싱을 할 때에는 시작 인덱스, 마지막 인덱스를 포함
##### 결론 : 인덱스가 rangeindex인 판다스 시리즈에서 인덱싱을 할 때, 목적에 따라 iloc나 loc 연산자를 사용하는 게 더 좋음
- 대괄호 인덱싱은 사용하지 않도록 주의

In [32]:
summer = pd.read_csv("summer.csv", index_col = "Athlete")

In [33]:
summer.head()

,Year,City,Sport,Discipline,Country,Gender,Event,Medal
Athlete,,,,,,,,
"HAJOS, Alfred",1896,Athens,Aquatics,Swimming,HUN,Men,100M Freestyle,Gold
"HERSCHMANN, Otto",1896,Athens,Aquatics,Swimming,AUT,Men,100M Freestyle,Silver
"DRIVAS, Dimitrios",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Bronze
"MALOKINIS, Ioannis",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Gold
"CHASAPIS, Spiridon",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Silver

In [34]:
event = summer.Event

In [35]:
event.head()

Athlete
HAJOS, Alfred                     100M Freestyle
HERSCHMANN, Otto                  100M Freestyle
DRIVAS, Dimitrios     100M Freestyle For Sailors
MALOKINIS, Ioannis    100M Freestyle For Sailors
CHASAPIS, Spiridon    100M Freestyle For Sailors
Name: Event, dtype: object

In [36]:
event.loc["PHELPS, Michael"]

Athlete
PHELPS, Michael            100M Butterfly
PHELPS, Michael            200M Butterfly
PHELPS, Michael            200M Freestyle
PHELPS, Michael    200M Individual Medley
PHELPS, Michael    400M Individual Medley
PHELPS, Michael    4X100M Freestyle Relay
PHELPS, Michael       4X100M Medley Relay
PHELPS, Michael    4X200M Freestyle Relay
PHELPS, Michael            100M Butterfly
PHELPS, Michael            200M Butterfly
PHELPS, Michael            200M Freestyle
PHELPS, Michael    200M Individual Medley
PHELPS, Michael    400M Individual Medley
PHELPS, Michael    4X100M Freestyle Relay
PHELPS, Michael       4X100M Medley Relay
PHELPS, Michael    4X200M Freestyle Relay
PHELPS, Michael            100M Butterfly
PHELPS, Michael            200M Butterfly
PHELPS, Michael               200M Medley
PHELPS, Michael          4X100M Freestyle
PHELPS, Michael             4X100M Medley
PHELPS, Michael          4X200M Freestyle
Name: Event, dtype: object

# Sorting and introduction to the inplace-parameter

In [37]:
# 주간 판매량 딕셔너리
dic = {1:10, 3:25, 2:6, 4:36, 5:2, 6:0, 7:None}
dic
# 1~7까지는 요일, 원래 1~5 순서로 되어 있어야 하는데 수요일이 먼저 나옴(3), 토,일은 휴일이므로 판매량 없음. 토요일은 0, 일요일은 None으로 표기

{1: 10, 3: 25, 2: 6, 4: 36, 5: 2, 6: 0, 7: None}

In [46]:
sales = pd.Series(dic)
sales

1    10.0
3    25.0
2     6.0
4    36.0
5     2.0
6     0.0
7     NaN
dtype: float64

In [49]:
# 요일별로 정렬하기 위해 sort_index() 사용, 오름차순과 내림차순 사용 가능, 기본 설정은 오름차순으로서 작은 것부터 시작함
sales.sort_index()

1    10.0
2     6.0
3    25.0
4    36.0
5     2.0
6     0.0
7     NaN
dtype: float64

In [53]:
sales.sort_index(ascending=True)
# 여기까지 하고 실행하면 월~일 순서대로 나옴
# 다만 sales로 출력하면 원래 입력한 딕셔너리의 키 순서대로 출력됨. 즉, 아직 sales에 저장되지 않았음을 의미
# 여기서 한 것은 series의 복사본을 만들어서 그 복사본만을 정렬한 것임

1    10.0
2     6.0
3    25.0
4    36.0
5     2.0
6     0.0
7     NaN
dtype: float64

In [65]:
sales.sort_index(ascending=True,  inplace=True)
# sort_index의 파라미터 중 하나인 inplace가 정렬된 값이 원래 값을 대신하는지 결정하게 됨, 기본적으로 False이므로 True로 설정할 경우 정렬 값이 원래 값을 대체
# inplace 매우 중요!!

#### sort_values

In [68]:
sales.sort_values(ascending=False, inplace=False)
# na_position 파라미터 "last" 는 NaN값을 어느 위치에 출력할 지 결정

4    36.0
3    25.0
1    10.0
2     6.0
5     2.0
6     0.0
7     NaN
dtype: float64

## What if, dic의 키가 숫자가 아닌 Mon ~ Fri와 같이 문자열이라면?

In [70]:
dic_str = {"Mon":10, "Tue":25, "Wed":6, "Thu":36, "Fri":2}
dic_str

{'Mon': 10, 'Tue': 25, 'Wed': 6, 'Thu': 36, 'Fri': 2}

In [73]:
sales_dic_str = pd.Series(dic_str)

In [74]:
sales_dic_str
# 출력하면 기본적으로 딕셔너리에 입력된 순서대로 나옴

Mon    10
Tue    25
Wed     6
Thu    36
Fri     2
dtype: int64

In [75]:
sales_dic_str.sort_index(ascending=False)
# 오름차순, 내림차순 기준에 따라 알파벳 순으로 출력됨

Wed     6
Tue    25
Thu    36
Mon    10
Fri     2
dtype: int64

## nlargest(), nsmallest() 메소드

In [81]:
# 만약 밸류 값이 가장 큰 것부터(내림차순) 순서대로 3개를 가져오고 싶다면 어떻게 해야 할까?
# values값을 정렬하는 sort_values를 열고, 오름차순을 False하고, .head 메소드를 이용해서 3개만 가져오도록 해야 한다
age.sort_values(ascending=False).head(3)

630    80.0
851    74.0
493    71.0
Name: age, dtype: float64

In [82]:
# 이러한 결과를 얻기 위해 nlargest라는 메소드를 이용할 수 있다. 반대로 가장 작은 값부터 순서대로 가져오고 싶다면 nsmallest를 이용하면 된다.
age.nlargest(3)

630    80.0
851    74.0
96     71.0
Name: age, dtype: float64

In [83]:
# 가장 어린 승객의 값을 3개 가져오고 싶다면?
age.sort_values(ascending=True).iloc[:3]

803    0.42
755    0.67
644    0.75
Name: age, dtype: float64

In [85]:
age.nsmallest(n = 3)

803    0.42
755    0.67
469    0.75
Name: age, dtype: float64

## 41. idxmin(), idxmax() 메소드

앞에서는 nlargest, nsmallest를 이용해서 가장 나이가 많거나 적은 승객의 연령(값)을 가져왔다.
만약 값이 아니라 인덱스 라벨만 알고 싶다면?
그럴 땐 .index 속성을 이용!

In [86]:
# example
age.nlargest(n = 3).index[0]

630

In [88]:
age.nsmallest(n = 3).index

Index([803, 755, 469], dtype='int64')

In [92]:
titanic.age.idxmin()

803

In [ ]:
titanic.loc[803]

In [ ]:
# titanic.age.idxmin()을 이용해서 나이 열의 값이 가장 작은 인덱스를 가져오고, 해당 인덱스의 모든 열 값을 출력하도록 하였다.
# 이를 한 줄의 코드로 끝내려고 한다면?
titanic.loc[titanic.age.idxmin()]
# titanic.loc >> titanic 변수에서 가져온다, titanic.age.idxmin() >> titanic의 age열에서 가장 작은 값의 인덱스를

## 42. 판다스 시리즈 다루기

In [95]:
# 시리즈의 값을 입력하고, 인덱스를 입힌 다음 변수에 저장하려면?
sales = pd.Series([10,25,6,36,2,0,None,5], index= ["Mon","Tue","Wed","Thu","Fri","Sat","Sun","Mon"])
sales

Mon    10.0
Tue    25.0
Wed     6.0
Thu    36.0
Fri     2.0
Sat     0.0
Sun     NaN
Mon     5.0
dtype: float64

In [98]:
sales.iloc[3] = 30

In [101]:
(sales/1.1)

Mon     9.090909
Tue    22.727273
Wed     5.454545
Thu    27.272727
Fri     1.818182
Sat     0.000000
Sun     0.000000
Mon     4.545455
dtype: float64

In [103]:
sales_EUR = (sales/1.1).round(2)
sales_EUR

Mon     9.09
Tue    22.73
Wed     5.45
Thu    27.27
Fri     1.82
Sat     0.00
Sun     0.00
Mon     4.55
dtype: float64